/* Q1)
tbl_employee 테이블에서 부서코드가 D9인 사원을 조회하시오.
*/

/* Q2)
부서코드가 D6이고 급여를 200만원보다 많이 받는 직원의 이름, 부서코드, 급여를 조회하시오.
*/

/* Q3)
보너스를 받지 않는 사원에 대해 사번, 직원명, 급여, 보너스를 조회하시오.
*/

/* Q4)
tbl_employee 테이블에서 급여를 350만원 이상, 550만원 이하를 받는 직원의
사번, 이름, 급여, 부서코드, 직급코드를 조회하시오.
*/

/* Q5)
tbl_employee 테이블에서 '하'가 이름에 포함된 직원의 이름, 주민번호, 부서코드를 조회하시오.
*/

/* Q6)
tbl_employee 테이블에서 부서가 배정된 직원들의 부서코드를 중복 없이 조회하시오.
단, 부서코드를 기준으로 오름차순 정렬하시오.
(힌트: WHERE, DISTINCT, ORDER BY)
*/

/* Q7)
tbl_employee 테이블에서 급여가 300만원 이상인 직원 중 급여가 높은 5명의
사번, 직원명, 급여를 조회하시오.
단, 급여가 같으면 사번을 기준으로 오름차순 정렬하시오.
(힌트: WHERE, ORDER BY, LIMIT)
*/

/* Q8)
tbl_employee 테이블에서 부서코드가 D5 또는 D9이고 2000년 이후에 입사한 직원 중
입사일이 빠른 3명의 사번, 직원명, 부서코드, 입사일을 조회하시오.
(힌트: WHERE, IN, ORDER BY, LIMIT)
*/

/* Q9)
tbl_employee 테이블에서 보너스를 받는 직원들의 직급코드를 중복 없이 조회하시오.
단, 직급코드를 기준으로 오름차순 정렬하시오.
(힌트: WHERE, IS NOT NULL, DISTINCT, ORDER BY)
*/

/* Q10)
tbl_employee 테이블에서 퇴직하지 않은 직원을 급여가 높은 순으로 정렬하시오.
급여가 같으면 사번을 기준으로 오름차순 정렬하고, 상위 3명을 건너뛴 다음 3명의
사번, 직원명, 급여를 조회하시오.
(힌트: WHERE, ORDER BY, LIMIT 시작위치, 개수)
*/
